Term4/discrete/lectures/3.tex
% Created 2021-04-06 Tue 22:47
% Intended LaTeX compiler: pdflatex

\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}
\usetikzlibrary{automata, arrows}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\A}{\mathfrak{A}}
\newcommand{\rank}{\mathop{\rm rank}\nolimits}
\newcommand{\const}{\var{const}}
\newcommand{\grad}{\mathop{\rm grad}\nolimits}

\newcommand{\todo}{{\color{red}\fbox{\text{Доделать}}}}
\newcommand{\fixme}{{\color{red}\fbox{\text{Исправить}}}}

\newcounter{propertycnt}
\setcounter{propertycnt}{1}
\newcommand{\beginproperty}{\setcounter{propertycnt}{1}}

\theoremstyle{plain}
\newtheorem{propertyinner}{Свойство}
\newenvironment{property}{
  \renewcommand\thepropertyinner{\arabic{propertycnt}}
  \propertyinner
}{\endpropertyinner\stepcounter{propertycnt}}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 3}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Ассимпточиское поведение линейных рекуррент}
\label{sec:orgb3333b6}
\subsection{Квазимногчлен в рациональную ПФ}
\label{sec:org25fc312}
\begin{lemma}
\-
\begin{itemize}
\item \(a_n = n^k r^n\)
\item \(A(t) = \frac{P(t)}{Q(t)}\)
\end{itemize}
\uline{Тогда} \(Q(t) = (1 - rt)^{k + 1}\)
\[ A(t) = \frac{1}{r}\cdot \frac{P'_k(t)(1 - rt) + r(k + 1)P_k(t) - \sum_{i = 0}^k r \binom{k + 1}{i} P_i(t) (1 - rt)^{k - i + 1}}{(1 - rt)^{k + 2}} \]
\end{lemma}
\begin{proof}
\todo
\end{proof}
\begin{lemma}
\-
\begin{itemize}
\item \(a_n = p(n) r^n\)
\item \(A(t) = \frac{P(t)}{Q(t)}\)
\end{itemize}
\uline{Тогда} \(Q(t) = (1 - rt)^{\deg p + 1}\)
\end{lemma}
\begin{corollary}
Квазимногочлен \(\Rightarrow\) Рациональная ПФ: \\
Корни \(Q(t)\): \(\frac{1}{r_i}\) кратности \(\deg p_i + 1\)
\end{corollary}

\subsection{Рациональная ПФ в квазимногочлен}
\label{sec:orgf2a4ea1}
\begin{itemize}
\item \(A(t) = \frac{P(t)}{Q(t)}\)
\end{itemize}
\[ Q(t) = \prod_{i = 1}^s (1 - r_it)^{f_i} \]
\[ \frac{P(t)}{Q(t)} = \sum_{i = 1}^s \frac{P_i(t)}{(1 - r_i t)^{f_i}} \]
\begin{lemma}
\[ A(t) = \frac{P(t)}{(1 - rt)^{k + 1}} \]
\uline{Тогда} \[ a_n = p(n) r^n \], \(p\) --- полином, \(\deg p = k\)
\[ A(t) = P(t) U(t) \]
\[ U(t) = (1 + rt + r^2 t^2 + \dots)^{k + 1} \]
\[ a_n = \sum_{i = 0}^n p_i u_{n - i} \]
\end{lemma}
\begin{corollary}
\[ a_n = \sum_{x_1 + x_2 + \dots + x_{k + 1} = n} r^n = \binom{n + 1 + k - 1}{k}r^n = \binom{n + k}{k}r^n = \]
\[ = \frac{1}{k!}(n + k)(n + k - 1)\dots(n + 1)r^n = p_k(n)r^n \]
\[ \sum_{i = 0}^m p_i u_i = \left(\sum_{i = 1}^m \frac{p_{n - i}(n)}{r^i}\right)r^n \]
\end{corollary}
\subsection{Оценка ассимптотического поведения}
\label{sec:orgcc96b1a}
Обратные корни: \(\begin{matrix} r_1 & f_1 \\ r_2 & f_2 \\ \vdots & \vdots \\ r_s & f_s \end{matrix}\)
\beginproperty
\begin{property}
\-
\begin{itemize}
\item \(\exists r_i: |r_i|\) --- max
\item \(\forall j \neq i:\ |r_j| < |r_i|\)
\end{itemize}
\(r_i\) вещественные \(a_n \sim n^{f_i - 1}\cdot r_i^n\)
\end{property}
\begin{property}
Несколько \(r_i\) имеют \(\max|r_i|\)
\begin{enumerate}
\item \(r_i \in \R\), \(r_i = \pm r\). Если разной кратности у \(r_i, r_j\), соответсвенно \(f_i > f_j\) \\
Тогда \(a_n \sim n^{f_i - 1}r_i^n(+n^{f_i - 1}r_j^n)\) \\
Если одинаковой кратности \(f_i = f_j\) \\
Тогда \(a_n \sim c_1 n^{f_i - 1}r^n + c_2 n^{f_j - 1}(-r)^n\)
\end{enumerate}
\end{property}
\begin{property}
\(r_1, r_2, \dots, r_l\) --- орбратные корни максимальной степени \(\max|r_i|\) и \(\max f_i\)
\[ r_i = z_i e^{i\phi_i} \]
\[ a_n \sim n^{f_i} z^n \sum_{j = 1}^l e^{i\phi_j} \]
Если \(\phi_j = \frac{2\pi a_j}{b_j}\), \(n\) делится на \(\mathop{\rm LCM}(b_j)\) классов
\end{property}

\begin{examp}
Числа каталана:
\[ c_n = \sum_{k = 0}^{n - 1}c_k c_{n - k - 1} \]
\[ C(t) = c_0 + c_1 t + c_2 t^2 + \dots \]
\[ C(t)^2 = c_0^2 + (c_0 c_1 + c_1 c_0) t + \dots \]
\[ C(t)^2 \cdot t + 1 = C(t) \]
\[ t\cdot C(t)^2 - C(t) + 1 = 0 \]
\[ C(t) = \frac{1 - \sqrt{1 - 4t}}{2t} \]
\end{examp}
\begin{remark}
Рассмотрим \((1 - t)^\alpha\):
\[ (1 - t)^\alpha = \sum_{i = 0}^\infty \binom{\alpha}{i} t^i = P_\alpha(t) \]
\[ \binom{\alpha}{t} = \frac{\alpha(\alpha - 1)(\alpha - 2)\cdot(\alpha - i + 1)}{1 \cdot 2 \cdot 3 \cdot \dots \cdot i} \]
\[ P_{\frac{1}{2}}(-4t) = 1 - 2t - 2t^2 - 4t^3 - 10t^4 \]
\[ \binom{\frac{1}{2}}{2} = \frac{\frac{1}{2}\cdot \left(-\frac{1}{2}\right)}{1\cdot 2} = -\frac{1}{8} \]
\[ \binom{\frac{1}{2}}{3} = \frac{\frac{1}{2} \cdot \left(-\frac{1}{2}\right) \left(-\frac{3}{2}\right)}{1 \cdot 2 \cdot 3} = \frac{1}{16} \]
\end{remark}
\end{document}
